export const WORDS_ARRAY = ['телефон', 'лютеница', 'краставица', 'сандвич', 'хладилник', 'подводница', 'хипопотам', 'кренвирш', 'патладжан',
    'самолет', 'ястреб', 'калъфка', 'чушкопек', 'пистолет', 'земевладелец', 'тиквеник', 'карамфил', 'носорог', 'каишка', 'отвертка',
    'костенурка', 'цвекло', 'майстор', 'владетел', 'дърворезба', 'котловина', 'камък', 'карамел', 'тирбушон', 'салфетка', 'пощальон',
    'пашкул', 'пармезан', 'карфиол', 'шоколад', 'ягода', 'кремък', 'върколак', 'шибидах', 'марионетка', 'крокодил', 'футбол',
    'анимация', 'баскетбол', 'зъбобол', 'кралица', 'вилица', 'яхния', 'сладолед', 'телевизор', 'сушилня', 'пералня', 'съдомиялна', 'автомобил',
    'самосвал', 'трактор', 'мицубиши', 'подполковник', 'масон', 'бледолик', 'аперол', 'жлъчка', 'апендикс', 'космонавт', 'задкулисие', 'сиртаки',
    'портокал', 'ябълка', 'пачикрак', 'тиквичка', 'чаршаф', 'одеяло', 'кожух', 'бизон', 'бръчка', 'мръсотия', 'камикадзе', 'водолаз', 'физика',
    'астрономия', 'къмпинг', 'мореплавател', 'скафандър', 'тортия', 'прасенце', 'търнокоп', 'багер', 'мотика', 'таблет', 'компютър', 'чешма',
    'лъжица', 'паничка', 'прическа', 'пиратство', 'интернет', 'смокиня', 'огнище', 'самодоволен', 'къщурка', 'тайфун', 'касерола', 'контейнер',
    'афинитет', 'кошница', 'камембер', 'партизан', 'хайдутин', 'ферари', 'формула', 'кашалот', 'усойница', 'гъсеница', 'шалот', 'змиорка', 'художник',
    'архитект', 'музикант', 'кучкарник', 'самозванец', 'парашутист', 'халапеньо', 'конкурент', 'компонент', 'функция', 'фрагмент', 'сурвачка', 'планктон',
    'гостилница', 'чекмедже', 'пантоф', 'парфюм', 'совалка',
];

export const LETTERS_ARRAY = ['а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ь', 'ю', 'я'];

export let USED_WORDS = [];

export function resetUsedWords() {
    return USED_WORDS = [];
}